
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user , expiring  5 Jul 2021
Serial number: 401609700731
  Licensed to: Yongseok Kim
               Indiana University Bloomington

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do tabulate_tab4.do 

. clear all

. set more off

. 
. cd "~/Projects/Replication/LRZ2008"
/Users/apple/Projects/Replication/LRZ2008

. use "analysis/input/prepared"

. tsset gvkey fyear
       panel variable:  gvkey (unbalanced)
        time variable:  fyear, 1965 to 2003, but with gaps
                delta:  1 unit

. 
. qui reg logsale fyear, nocons

. predict logsaler, r
(9,101 missing values generated)

. 
. preserve

. collapse (firstnm) initblev = blev, by(gvkey)

. tempfile initblev

. save `initblev', replace
(note: file /var/folders/5x/ys8vrl6n4yvbdxjwvb5k0nf00000gn/T//St65115.000002 no
> t found)
file /var/folders/5x/ys8vrl6n4yvbdxjwvb5k0nf00000gn/T//St65115.000002 saved

. restore

. 
. preserve

. collapse (firstnm) initmlev = mlev, by(gvkey)

. tempfile initmlev

. save `initmlev', replace
(note: file /var/folders/5x/ys8vrl6n4yvbdxjwvb5k0nf00000gn/T//St65115.000004 no
> t found)
file /var/folders/5x/ys8vrl6n4yvbdxjwvb5k0nf00000gn/T//St65115.000004 saved

. restore

. 
. merge m:1 gvkey using `initblev'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           271,139  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. merge m:1 gvkey using `initmlev'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           271,139  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. tsset gvkey fyear
       panel variable:  gvkey (unbalanced)
        time variable:  fyear, 1965 to 2003, but with gaps
                delta:  1 unit

. 
. foreach v in logsaler mtb prof tang cfvol indblev divpayer {
  2.         forvalues j = 1/8 {
  3.                 gen lag`j'_`v' = L`j'.`v'
  4.         }
  5. }
(33,795 missing values generated)
(57,005 missing values generated)
(78,427 missing values generated)
(97,910 missing values generated)
(115,647 missing values generated)
(131,416 missing values generated)
(145,286 missing values generated)
(157,940 missing values generated)
(99,574 missing values generated)
(116,576 missing values generated)
(132,034 missing values generated)
(146,030 missing values generated)
(158,398 missing values generated)
(169,448 missing values generated)
(179,368 missing values generated)
(188,343 missing values generated)
(33,768 missing values generated)
(57,101 missing values generated)
(78,598 missing values generated)
(98,187 missing values generated)
(115,996 missing values generated)
(131,786 missing values generated)
(145,668 missing values generated)
(158,350 missing values generated)
(29,827 missing values generated)
(53,882 missing values generated)
(75,948 missing values generated)
(96,011 missing values generated)
(114,167 missing values generated)
(130,255 missing values generated)
(144,360 missing values generated)
(157,247 missing values generated)
(90,996 missing values generated)
(108,898 missing values generated)
(124,860 missing values generated)
(138,957 missing values generated)
(151,810 missing values generated)
(163,345 missing values generated)
(173,452 missing values generated)
(182,522 missing values generated)
(26,209 missing values generated)
(50,713 missing values generated)
(73,170 missing values generated)
(93,561 missing values generated)
(112,018 missing values generated)
(128,369 missing values generated)
(142,696 missing values generated)
(155,765 missing values generated)
(26,211 missing values generated)
(50,715 missing values generated)
(73,172 missing values generated)
(93,561 missing values generated)
(112,018 missing values generated)
(128,368 missing values generated)
(142,696 missing values generated)
(155,765 missing values generated)

. 
. by gvkey: drop if _n == 1
(25,413 observations deleted)

. 
. foreach v of varlist lag*_* {
  2.         drop if missing(`v')
  3. }
(8,382 observations deleted)
(24,856 observations deleted)
(22,487 observations deleted)
(20,189 observations deleted)
(18,188 observations deleted)
(16,059 observations deleted)
(14,025 observations deleted)
(12,675 observations deleted)
(19,283 observations deleted)
(2,009 observations deleted)
(1,942 observations deleted)
(2,139 observations deleted)
(2,219 observations deleted)
(2,441 observations deleted)
(2,974 observations deleted)
(5,861 observations deleted)
(518 observations deleted)
(212 observations deleted)
(196 observations deleted)
(182 observations deleted)
(181 observations deleted)
(189 observations deleted)
(225 observations deleted)
(280 observations deleted)
(300 observations deleted)
(127 observations deleted)
(103 observations deleted)
(98 observations deleted)
(96 observations deleted)
(100 observations deleted)
(105 observations deleted)
(109 observations deleted)
(24 observations deleted)
(5 observations deleted)
(6 observations deleted)
(8 observations deleted)
(16 observations deleted)
(1,480 observations deleted)
(3,407 observations deleted)
(3,423 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)

. 
. foreach v of varlist initblev initmlev lag*_* {
  2.         egen `v'_std = std(`v')
  3. }

. 
. global control "lag*_logsaler_std lag*_mtb_std lag*_prof_std lag*_tang_std la
> g*_indblev_std lag*_cfvol_std lag*_divpayer_std"

. 
. /* Book leverage equations */
. 
. qui reghdfe blev initblev_std $control, a(cyear) cl(gvkey)

. mat b = e(b)

. mat V = e(V)

. local r2_ : di %3.2f e(r2_a)

. local nobs = e(N)

. 
. mata
------------------------------------------------- mata (type end to exit) -----
: b = st_matrix("b")

: V = st_matrix("V")

: 
: bshort = b[1, (1, 2, 10, 18, 26, 34, 42, 50)]

: Vshort = V[(1, 2, 10, 18, 26, 34, 42, 50), (1, 2, 10, 18, 26, 34, 42, 50)]

: st_matrix("bshort", bshort)

: st_matrix("Vshort", Vshort)

: 
: b2 = b[1, 2..57]

: V2 = V[2..57, 2..57]

: 
: v1 = sum(V2[1..8, 1..8])

: v2 = sum(V2[9..16, 9..16])

: v3 = sum(V2[17..24, 17..24])

: v4 = sum(V2[25..32, 25..32])

: v5 = sum(V2[33..40, 33..40])

: v6 = sum(V2[41..48, 41..48])

: v7 = sum(V2[49..56, 49..56])

: 
: Vlong = diag((v1, v2, v3, v4, v5, v6 ,v7))

: 
: blong = rowshape(b2, 7)

: blong = rowsum(blong)

: blong = rowshape(blong, 1)

: st_matrix("blong", blong)

: st_matrix("Vlong", Vlong)

: end
-------------------------------------------------------------------------------

. 
. mat colnames bshort = "initlev" "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof
> _std" "lag1_tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. mat rownames Vshort = "initlev" "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof
> _std" "lag1_tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. mat colnames Vshort = "initlev" "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof
> _std" "lag1_tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. 
. ereturn post bshort Vshort, obs(`nobs')

. estadd local r2_ "`r2_'"

added macro:
                e(r2_) : "0.25"

. estadd local yearfixed "Yes"

added macro:
          e(yearfixed) : "Yes"

. eststo est1

. 
. mat colnames blong = "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof_std" "lag1
> _tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. mat rownames Vlong = "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof_std" "lag1
> _tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. mat colnames Vlong = "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof_std" "lag1
> _tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. 
. ereturn post blong Vlong

. eststo est2

. 
. * Market Leverage Equation
. qui reghdfe mlev initmlev_std $control, a(cyear) cl(gvkey)

. mat b = e(b)

. mat V = e(V)

. local r2_ : di %3.2f e(r2_a)

. local nobs = e(N)

. 
. mata
------------------------------------------------- mata (type end to exit) -----
: b = st_matrix("b")

: V = st_matrix("V")

: 
: bshort = b[1, (1, 2, 10, 18, 26, 34, 42, 50)]

: Vshort = V[(1, 2, 10, 18, 26, 34, 42, 50), (1, 2, 10, 18, 26, 34, 42, 50)]

: st_matrix("bshort", bshort)

: st_matrix("Vshort", Vshort)

: 
: b2 = b[1, 2..57]

: V2 = V[2..57, 2..57]

: 
: v1 = sum(V2[1..8, 1..8])

: v2 = sum(V2[9..16, 9..16])

: v3 = sum(V2[17..24, 17..24])

: v4 = sum(V2[25..32, 25..32])

: v5 = sum(V2[33..40, 33..40])

: v6 = sum(V2[41..48, 41..48])

: v7 = sum(V2[49..56, 49..56])

: 
: Vlong = diag((v1, v2, v3, v4, v5, v6 ,v7))

: 
: blong = rowshape(b2, 7)

: blong = rowsum(blong)

: blong = rowshape(blong, 1)

: st_matrix("blong", blong)

: st_matrix("Vlong", Vlong)

: end
-------------------------------------------------------------------------------

. 
. mat colnames bshort = "initlev" "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof
> _std" "lag1_tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. mat rownames Vshort = "initlev" "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof
> _std" "lag1_tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. mat colnames Vshort = "initlev" "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof
> _std" "lag1_tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. 
. ereturn post bshort Vshort, obs(`nobs')

. estadd local r2_ "`r2_'"

added macro:
                e(r2_) : "0.39"

. estadd local yearfixed "Yes"

added macro:
          e(yearfixed) : "Yes"

. eststo est3

. 
. mat colnames blong = "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof_std" "lag1
> _tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. mat rownames Vlong = "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof_std" "lag1
> _tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. mat colnames Vlong = "lag1_logsaler_std" "lag1_mtb_std" "lag1_prof_std" "lag1
> _tang_std" "lag1_indblev_std" "lag1_cfvol_std" "lag1_divpayer_std"

. 
. ereturn post blong Vlong

. eststo est4

. 
. esttab est1 est2 est3 est4 using "analysis/output/tab/tab4.tex", replace b(%3
> .2f) t(%3.2f) booktabs nostar nonotes nomtitles nonumbers stats(yearfixed r2_
>  N, fmt(%10.0fc) label("Year fixed effects" "Adj. $ R^2$" "Obs.")) msign("$-$
> ") ///
> keep(initlev lag1*) ///
> order(initlev) ///
> coeflabel(initlev "Initial leverage" lag1_logsaler_std "Log(Sales)" lag1_mtb_
> std "Market-to-book" lag1_prof_std "Profitability" lag1_tang_std "Tangibility
> " lag1_cfvol_std "Cash flow vol." lag1_indblev_std "Industry median lev." lag
> 1_divpayer_std "Dividend payer") ///
> posthead(" & \multicolumn{2}{c}{Book Leverage} & \multicolumn{2}{c}{Market Le
> verage} \\ \cmidrule(lr){2-3} \cmidrule(lr){4-5}" "Variable & Short Run & Lon
> g Run & Short Run & Long Run \\ \midrule") ///
> prefoot("\\")
(output written to analysis/output/tab/tab4.tex)

. 
end of do-file
